export const About = () => {
  return (
    <div className='flex justify-center px-6 md:px-10 py-2'>
      <p className='text-lg tracking-wide leading-loose'>
        歡迎來到我的個人網站👋我是一名新手前端工程師！從行政領域轉職，我決定追隨我的興趣，進入網頁開發的世界。
        <br />
        網頁開發對我來說是一種很棒的創作和表達思想的方式。就像是創建一個魔法世界，透過各種奇妙的技術將想法變為現實，藉由網路的力量能夠將我的想法與技術帶給更多人，創造出更好的網頁使用體驗。
        <br />
        我的個人網站是我學習過程的成果展示，其中包含我撰寫的技術文章、開發作品集，以及提供與我聯絡的方式。如果你對我的作品或任何合作機會感興趣，歡迎隨時透過網站上的聯絡方式與我聯繫！
        <br />
        很高興你的來訪，期待一起在網頁開發的世界相遇！
      </p>
    </div>
  );
};
